short = {}                # --------------------------거리 딕셔너리 만들기
#---------------집에서 집,미용실,슈퍼,영어학원,레스토랑,은행,학교까지 거리
home = [0, 1, 2, 999, 7, 999, 999, 999]
short['index'] = [1,2,3,4,5,6,7,8]
short[1] = [1, 0, 999, 2, 999, 999, 4, 999]
short[2] = [2, 999, 0, 999, 999, 5, 999, 999]
short[3] = [999, 2, 999, 0, 999, 999, 1, 999]
short[4] = [7, 999, 999, 999, 0, 3, 2, 999]
short[5] = [999, 999, 5, 999, 3, 0, 999, 2]
short[6] = [999, 4, 999, 1, 2, 999, 0, 6]
short[7] = [999, 999, 999, 999, 999, 2, 6, 0]
temp = [0 for i in range(8)]    # ---------------------최소거리 비교를 위한 임시 리스트 만들기

def minimum(a,b):              # ---------------------최소값 함수 만들기
    if a>=b:
        return b
    return a

def lpad(a,b,c):                 # ---------------------깔끔한 출력을 위한 lpad 함수 만들기
    return a

for i in range(1,len(short['index'])) :
    for j in range(len(home)) :           # ---------------temp에 집 -> 장소x까지의 거리 저장
        temp[j] = home[i] + short[i][j]
        home[j] = minimum(temp[j],home[j])   #---------temp 값과 기존 최소거리 비교해 최소값 갱신

for k in range(len(short['index'])):             #-----------결과 출력
    print('\n','집에서',str(lpad(short['index'][k],5,'  '))+'까지의 최단거리는',home[k],' 입니다.')